// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//
// let a =[2,6,4,5,9];
// let b = ["wed","sad","wqX","3erfvf","cxad"];
// let c = ['dwdc','wduxhai',51, 21,true];
// console.log(a,b,c)


// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let a = [];
// console.log(a)
// a[0] = 'store'
// console.log(a)


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let  a = [];
// for (let i=0; i<10;i++){
//     a[i]='<div>lorem<div/>'
// }
// for (let i = 1; i<=10;i++){
//     a[i]=`<div>дівка ${i}<div/>`;
// }
// let i =0
// while(i<20){
//     a[i]=`<h1>ашка<h1/>`
//     i++
// }
// let i =1
// while(i<=20){
//     a[i]=`<h1>ашка з індексом ${i}<h1/>`
//     i++
// }
// document.write(a)


// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// let b = ["lorem1", "lorem2", "lorem3", "lorem4", "lorem5", "lorem6", "lorem7", "lorem8", "lorem9", "lorem10"];
// let c = ["lorem1", 1, "lorem2", 2, "lorem3", 3, true, 4, false, "lorem4"]
// console.log(a, b, c)
// for (i=0;i<10;i++){
//     if (typeof (c[i]) === "boolean"){
//         console.log(c[i])
//     }
// }
// for (i = 0; i < 10; i++) {
//     if (typeof (c[i]) === "number") {
//         console.log(c[i])
//     }
// }
// for (i=0;i<10;i++){
//     if (typeof (c[i]) === "string"){
//         console.log(c[i])
//     }
// }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// let a = [];
// for (i = 0; i < 10; i++) {
//     if (i % 2) {
//         a[i] = ''
//     } else if (i % 3) {
//         a[i] = 1
//     } else {
//         a[i] = true
//     }
//     console.log(a)
// }
// for (i=0;i<10; i++){
//     console.log(i)
//     document.write(i)
// }
// for (i=0;i<100; i++){
//     console.log(i)
//     document.write(i)
// }
// for (i=0;i<200; i+=2){
//     console.log(i)
//     document.write(i)
// }
// for (i = 0; i < 100; i++) {
//     if (i % 2 === 0) {
//         console.log(i)
//         document.write(i)
//     }
//
// }
// for (i = 0; i < 100; i++) {
//     if (i % 2) {
//         console.log(i)
//         document.write(i)
//     }
//
// }